// #region 只读属性 Code Module
{
    var p1 = { x: 200, y: 200 };
    /* 只读属性不允许重新赋值 */
    // p1.x = 5;
}
// #endregion 只读属性 Code Module End
// -----------------------------------------分隔符--------------------------------------------
// #region 只读的数组 Code Module
{
    var a = [1, 2, 3, 4];
    var ro = a;
    a[1] = 3;
    a.push(10);
    ro.push(10);
    /* 编译时会报错 */
    // ro[1] = 5;
    // ro.push(11);
}
// #endregion 只读的数组 Code Module End
// -----------------------------------------分隔符--------------------------------------------
